Public Attributes | List of all members
API_ImagingAndCalcPrefs Struct Reference
Project Settings
The representation of the Imaging and Calculation tab page of the Work Environment dialog. More...
#include <APIdefs_Environment.h>
 Public Attributes
bool  | autoRebuild3D
Rebuild the 3D window whenever it's brought to the front.
bool  | activate3DOnChange
Bring the 3D window to the front whenever the 3D Projection Settings or Rendering modes are changed.
bool  | keepZoomedSection
Display previously magnified detail in the section window whenever the section window is rebuilt.
bool  | showProgressWindow
Display the 3D progress information window.
bool  | interruptOnError
Allow interruption of any imaging process.
bool  | progressSounds
Enable sound indications of 3D processes.
bool  | generate3DReport
Create a 3D Report window.
short  | reportLevel
Value of the slider that defines one of four levels of detail for the 3D Report:
short  | selElemsListing
Switch to define how to handle selected elements while listing:
Detailed Description
The representation of the Imaging and Calculation tab page of the Work Environment dialog.
Remarks
This structure is used by the ACAPI_ProjectSetting_GetPreferences function to get the settings of the Imaging and Calculation tab page of the Work Environment dialog.
Member Data Documentation
◆ activate3DOnChange
 API_ImagingAndCalcPrefs::activate3DOnChange
Bring the 3D window to the front whenever the 3D Projection Settings or Rendering modes are changed.
◆ autoRebuild3D
 API_ImagingAndCalcPrefs::autoRebuild3D
Rebuild the 3D window whenever it's brought to the front.
◆ generate3DReport
 API_ImagingAndCalcPrefs::generate3DReport
Create a 3D Report window.
◆ interruptOnError
 API_ImagingAndCalcPrefs::interruptOnError
Allow interruption of any imaging process.
◆ keepZoomedSection
 API_ImagingAndCalcPrefs::keepZoomedSection
Display previously magnified detail in the section window whenever the section window is rebuilt.
◆ progressSounds
 API_ImagingAndCalcPrefs::progressSounds
Enable sound indications of 3D processes.
◆ reportLevel
 API_ImagingAndCalcPrefs::reportLevel
Value of the slider that defines one of four levels of detail for the 3D Report:
 Value  | Report level
 APIReportLevel_No  | No Report
 APIReportLevel_Brief  | Brief Report
 APIReportLevel_Short  | Short Report
 APIReportLevel_Detailed  | Detailed Report
 APIReportLevel_Full  | Full Report
◆ selElemsListing
 API_ImagingAndCalcPrefs::selElemsListing
Switch to define how to handle selected elements while listing:
 Value  | Meaning
 APICalcSelElems_ShowAlert  | Display warning dialog to choose listing method
 APICalcSelElems_ListAll  | Calculate all selected elements in the list
 APICalcSelElems_UseFilters  | Apply filters defined for the selected elements
◆ showProgressWindow
 API_ImagingAndCalcPrefs::showProgressWindow
Display the 3D progress information window.